notes/dependant-packages.org
* python package dependants

This work would not be possible without [[https://libraries.io][libraries.io]]

** Download and initialize the data
   :PROPERTIES:
   :header-args: :db ~/data/librariesio/libraries.db
   :END:

First we collect the [[https://libraries.io/data][libraries.io data]] (around 20 GB). Good thing I
have =1 Gbit/s= internet now! We extract the archive and use sqlite to
create a database from the csv files [[https://www.sqlite.org/cli.html][documented here]].

#+begin_src shell :eval never
  wget https://zenodo.org/record/2536573/files/Libraries.io-open-data-1.4.0.tar.gz
  tar -xf Libraries.io-open-data-1.4.0.tar.gz
#+end_src

Sqlite is unique in that columns do not have types only values
do. Here each value is either a string or ~NULL~.

#+begin_src sqlite :eval never :results none
  .mode csv
  .delimiter ','
  .import Libraries.io-open-data-1.4.0/dependencies.csv dependencies
  .import Libraries.io-open-data-1.4.0/repository_dependencies.csv repository_dependencies
  .import Libraries.io-open-data-1.4.0/projects.csv projects
  .import Libraries.io-open-data-1.4.0/dependencies.csv dependencies
  .import Libraries.io-open-data-1.4.0/dependencies.csv dependencies
  .import Libraries.io-open-data-1.4.0/dependencies.csv dependencies
#+end_src

Lets check that the tables were created

#+begin_src sqlite
.tables
#+end_src

#+RESULTS:
| dependencies                     repository_dependencies |
| projects                         tags                    |
| projects_with_repository_fields  versions                |
| repositories                                             |

This is a large dataset (80 GB) with several tables having 150M+
rows. Create indexes is extremely important for query speed.

#+begin_src sqlite :eval never :results none
  CREATE UNIQUE INDEX INDEX_DEPENDENCIES ON dependencies (ID);
  CREATE INDEX INDEX_DEPENDENCIES_PROJECT ON dependencies ("Dependency Project ID");
  CREATE UNIQUE INDEX INDEX_REPOSITORY_DEPENDENCIES ON repository_dependencies ("Repository ID");
  CREATE INDEX INDEX_REPOSITORY_DEPENDENCIES_PROJECT ON repository_dependencies ("Dependency Project ID");
  CREATE UNIQUE INDEX INDEX_PROJECTS ON projects (ID);
  CREATE INDEX INDEX_PROJECTS_NAME ON projects (Name);
  CREATE UNIQUE INDEX INDEX_TAGS ON tags (ID);
  CREATE UNIQUE INDEX INDEX_PROJECTS_WITH_REPOSITORY_FIELDS ON projects_with_repository_fields (ID);
  CREATE UNIQUE INDEX INDEX_VERSIONS ON versions (ID);
  CREATE UNIQUE INDEX INDEX_REPOSITORIES ON repositories (ID);
#+end_src

Lets check that the indexes were created

#+begin_src sqlite
.index
#+end_src

#+RESULTS:
| INDEX_DEPENDENCIES                     INDEX_REPOSITORIES            |
| INDEX_DEPENDENCIES_PROJECT             INDEX_REPOSITORY_DEPENDENCIES |
| INDEX_PROJECTS                         INDEX_TAGS                    |
| INDEX_PROJECTS_WITH_REPOSITORY_FIELDS  INDEX_VERSIONS                |

#+begin_src shell
du -sh ~/data/librariesio/libraries.db
#+end_src

#+RESULTS:
| 101G | /home/costrouc/data/librariesio/libraries.db |

Additional indexes added about 10-20 GB to the database.

