notes/dependant-packages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-24 Fri 16:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Christopher Ostrouchov" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdf3734c">1. python package dependants</a>
<ul>
<li><a href="#org7d0370a">1.1. Download and initialize the data</a></li>
<li><a href="#orgdd8db79">1.2. Discovery</a></li>
<li><a href="#orgf2f25b6">1.3. Recreate libraries.io data/api</a></li>
<li><a href="#orga39da4c">1.4. Generate Initial Dependants Files</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgdf3734c" class="outline-2">
<h2 id="orgdf3734c"><span class="section-number-2">1</span> python package dependants</h2>
<div class="outline-text-2" id="text-1">
<p>
This work would not be possible without <a href="https://libraries.io">libraries.io</a>
</p>
</div>

<div id="outline-container-org7d0370a" class="outline-3">
<h3 id="org7d0370a"><span class="section-number-3">1.1</span> Download and initialize the data</h3>
<div class="outline-text-3" id="text-1-1">
<p>
First we collect the <a href="https://libraries.io/data">libraries.io data</a> (around 20 GB). Good thing I
have <code>1 Gbit/s</code> internet now! We extract the archive and use sqlite to
create a database from the csv files <a href="https://www.sqlite.org/cli.html">documented here</a>.
</p>

<div class="org-src-container">
<pre class="src src-shell">wget https://zenodo.org/record/2536573/files/Libraries.io-open-data-1.4.0.tar.gz
tar -xf Libraries.io-open-data-1.4.0.tar.gz
</pre>
</div>

<p>
Sqlite is unique in that columns do not have types only values
do. Here each value is either a string or <code>NULL</code>.
</p>

<div class="org-src-container">
<pre class="src src-sqlite">.mode csv
.delimiter <span style="color: #8abeb7;">','</span>
.import Libraries.io-<span style="color: #b5bd68;">open</span>-<span style="color: #b5bd68;">data</span>-1.4.0/dependencies.csv dependencies
.import Libraries.io-<span style="color: #b5bd68;">open</span>-<span style="color: #b5bd68;">data</span>-1.4.0/repository_dependencies.csv repository_dependencies
.import Libraries.io-<span style="color: #b5bd68;">open</span>-<span style="color: #b5bd68;">data</span>-1.4.0/projects.csv projects
.import Libraries.io-<span style="color: #b5bd68;">open</span>-<span style="color: #b5bd68;">data</span>-1.4.0/dependencies.csv dependencies
.import Libraries.io-<span style="color: #b5bd68;">open</span>-<span style="color: #b5bd68;">data</span>-1.4.0/dependencies.csv dependencies
.import Libraries.io-<span style="color: #b5bd68;">open</span>-<span style="color: #b5bd68;">data</span>-1.4.0/dependencies.csv dependencies
</pre>
</div>

<p>
Lets check that the tables were created
</p>

<div class="org-src-container">
<pre class="src src-sqlite">.tables
</pre>
</div>

<p>
This is a large dataset (80 GB) with several tables having 150M+
rows. Create indexes is extremely important for query speed.
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">UNIQUE</span> INDEX INDEX_DEPENDENCIES <span style="color: #b5bd68;">ON</span> dependencies (ID);
<span style="color: #b5bd68;">CREATE</span> INDEX INDEX_DEPENDENCIES_PROJECT <span style="color: #b5bd68;">ON</span> dependencies ("Dependency Project ID");
<span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">UNIQUE</span> INDEX INDEX_REPOSITORY_DEPENDENCIES <span style="color: #b5bd68;">ON</span> repository_dependencies ("Repository ID");
<span style="color: #b5bd68;">CREATE</span> INDEX INDEX_REPOSITORY_DEPENDENCIES_PROJECT <span style="color: #b5bd68;">ON</span> repository_dependencies ("Dependency Project ID");
<span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">UNIQUE</span> INDEX INDEX_PROJECTS <span style="color: #b5bd68;">ON</span> projects (ID);
<span style="color: #b5bd68;">CREATE</span> INDEX INDEX_PROJECTS_NAME <span style="color: #b5bd68;">ON</span> projects (<span style="color: #b5bd68;">Name</span>);
<span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">UNIQUE</span> INDEX INDEX_TAGS <span style="color: #b5bd68;">ON</span> tags (ID);
<span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">UNIQUE</span> INDEX INDEX_PROJECTS_WITH_REPOSITORY_FIELDS <span style="color: #b5bd68;">ON</span> projects_with_repository_fields (ID);
<span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">UNIQUE</span> INDEX INDEX_VERSIONS <span style="color: #b5bd68;">ON</span> versions (ID);
<span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">UNIQUE</span> INDEX INDEX_REPOSITORIES <span style="color: #b5bd68;">ON</span> repositories (ID);
</pre>
</div>

<p>
Lets check that the indexes were created
</p>

<div class="org-src-container">
<pre class="src src-sqlite">.index
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">du -sh ~/data/librariesio/libraries.db
</pre>
</div>

<p>
Additional indexes added about 10-20 GB to the database.
</p>
</div>
</div>
