notes/dependant-packages.org
** Discovery
   :PROPERTIES:
   :header-args: :db ~/data/librariesio/libraries.db :header t
   :END:

#+begin_src sqlite
PRAGMA table_info(repository_dependencies);
#+end_src

#+RESULTS:
| cid | name                       | type | notnull | dflt_value | pk |
|   0 | ID                         | TEXT |       0 |            |  0 |
|   1 | Host Type                  | TEXT |       0 |            |  0 |
|   2 | Repository Name with Owner | TEXT |       0 |            |  0 |
|   3 | Repository ID              | TEXT |       0 |            |  0 |
|   4 | Manifest Platform          | TEXT |       0 |            |  0 |
|   5 | Manifest Filepath          | TEXT |       0 |            |  0 |
|   6 | Git branch                 | TEXT |       0 |            |  0 |
|   7 | Manifest kind              | TEXT |       0 |            |  0 |
|   8 | Optional                   | TEXT |       0 |            |  0 |
|   9 | Dependency Project Name    | TEXT |       0 |            |  0 |
|  10 | Dependency Requirements    | TEXT |       0 |            |  0 |
|  11 | Dependency Kind            | TEXT |       0 |            |  0 |
|  12 | Dependency Project ID      | TEXT |       0 |            |  0 |

#+begin_src sqlite
SELECT DISTINCT Language FROM repositories
#+end_src

#+RESULTS:
| Language                 |
| JavaScript               |
| CoffeeScript             |
| HTML                     |
| CSS                      |
|                          |
| TypeScript               |
| PHP                      |
| Shell                    |
| ActionScript             |
| Python                   |
| Pascal                   |
| Ruby                     |
| Makefile                 |
| C                        |
| XSLT                     |
| PureScript               |
| ApacheConf               |
| Objective-C              |
| Nix                      |
| Scala                    |
| Clojure                  |
| Java                     |
| LiveScript               |
| Elixir                   |
| Erlang                   |
| Swift                    |
| Objective-J              |
| Rust                     |
| D                        |
| TeX                      |
| C++                      |
| Emacs Lisp               |
| CMake                    |
| Cucumber                 |
| Haskell                  |
| Perl                     |
| Go                       |
| R                        |
| Julia                    |
| OCaml                    |
| Common Lisp              |
| Isabelle                 |
| Puppet                   |
| Lua                      |
| Mathematica              |
| Coq                      |
| Nimrod                   |
| Nim                      |
| PLSQL                    |
| Cirru                    |
| SuperCollider            |
| C#                       |
| Apex                     |
| wisp                     |
| Liquid                   |
| Dart                     |
| ASP                      |
| Haxe                     |
| Scheme                   |
| Hack                     |
| Gherkin                  |
| Smarty                   |
| Processing               |
| Common Workflow Language |
| Mirah                    |
| Fancy                    |
| Visual Basic             |
| Ragel                    |
| PLpgSQL                  |
| eC                       |
| Racket                   |
| Vim script               |
| VimL                     |
| PogoScript               |
| SQLPL                    |
| Vue                      |
| Zephir                   |
| Groovy                   |
| XML                      |
| Thrift                   |
| Assembly                 |
| Arduino                  |
| Yacc                     |
| Matlab                   |
| ColdFusion               |
| Gosu                     |
| GLSL                     |
| Groff                    |
| Eiffel                   |
| Batchfile                |
| OpenEdge ABL             |
| Handlebars               |
| Objective-C++            |
| Smalltalk                |
| AppleScript              |
| Dogescript               |
| RAML                     |
| PowerShell               |
| API Blueprint            |
| AutoIt                   |
| SourcePawn               |
| HCL                      |
| Prolog                   |
| FreeMarker               |
| Kotlin                   |
| Fortran                  |
| Max                      |
| XProc                    |
| Web Ontology Language    |
| Xtend                    |
| SMT                      |
| Genshi                   |
| Ceylon                   |
| Verilog                  |
| FLUX                     |
| Pan                      |
| ANTLR                    |
| Hy                       |
| GAP                      |
| Jupyter Notebook         |
| AGS Script               |
| Roff                     |
| Protocol Buffer          |
| Clean                    |
| POV-Ray SDL              |
| Tcl                      |
| F#                       |
| Smali                    |
| nesC                     |
| LLVM                     |
| Eagle                    |
| KiCad                    |
| QML                      |
| OpenSCAD                 |
| PostScript               |
| SQL                      |
| Io                       |
| Ada                      |
| M                        |
| Nginx                    |
| Elm                      |
| Logos                    |
| FORTRAN                  |
| NetLinx                  |
| Oxygene                  |
| AutoHotkey               |
| Boo                      |
| Propeller Spin           |
| Shen                     |
| XS                       |
| Perl6                    |
| Perl 6                   |
| MoonScript               |
| REALbasic                |
| VHDL                     |
| Pure Data                |
| NCL                      |
| DIGITAL Command Language |
| Slash                    |
| RenderScript             |
| Cuda                     |
| Inno Setup               |
| Awk                      |
| Dockerfile               |
| Jasmin                   |
| Mercury                  |
| Brainfuck                |
| 1C Enterprise            |
| WebAssembly              |
| Alloy                    |
| COBOL                    |
| Vala                     |
| Squirrel                 |
| Component Pascal         |
| IDL                      |
| Scilab                   |
| Dylan                    |
| Standard ML              |
| SaltStack                |
| Crystal                  |
| Nemerle                  |
| X10                      |
| GDB                      |
| LSL                      |
| Gnuplot                  |
| Mask                     |
| Agda                     |
| XQuery                   |
| NewLisp                  |
| RobotFramework           |
| Arc                      |
| Bison                    |
| Clarion                  |
| M4                       |
| CartoCSS                 |
| NSIS                     |
| VCL                      |
| Lasso                    |
| ABAP                     |
| Idris                    |
| Stata                    |
| Gettext Catalog          |
| JSONiq                   |
| Frege                    |
| PigLatin                 |
| NetLogo                  |
| Kit                      |
| Game Maker Language      |
| Brightscript             |
| Rebol                    |
| Diff                     |
| GCC Machine Description  |
| AspectJ                  |
| Ragel in Ruby Host       |
| BitBake                  |
| Forth                    |
| LookML                   |
| AMPL                     |
| Harbour                  |
| PowerBuilder             |
| Fantom                   |
| Bluespec                 |
| Redcode                  |
| Augeas                   |
| Mako                     |
| HyPhy                    |
| Rascal                   |
| BlitzBasic               |
| Red                      |
| Lex                      |
| Bro                      |
| Cycript                  |
| CLIPS                    |
| SQF                      |
| Chapel                   |
| Parrot                   |
| E                        |
| LilyPond                 |
| SAS                      |
| KRL                      |
| MTML                     |
| Terra                    |
| IGOR Pro                 |
| ECL                      |
| ooc                      |
| GDScript                 |
| DCPU-16 ASM              |
| Limbo                    |
| LoomScript               |
| Meson                    |
| xBase                    |
| SRecode Template         |
| REXX                     |
| SystemVerilog            |
| Factor                   |
| Volt                     |
| LabVIEW                  |
| Nextflow                 |
| BlitzMax                 |
| Lean                     |
| Ren'Py                   |
| Pony                     |
| QMake                    |
| Csound Document          |
| Opa                      |
| UnrealScript             |
| DM                       |
| Pike                     |
| Grammatical Framework    |
| APL                      |
| EmberScript              |
| Turing                   |
| ChucK                    |
| TXL                      |
| Modelica                 |
| Golo                     |
| PicoLisp                 |
| Monkey                   |
| Nu                       |
| PureBasic                |
| Stan                     |
| DOT                      |
| Grace                    |
| PAWN                     |
| MAXScript                |
| TI Program               |
| Glyph                    |
| Delphi                   |
| Rouge                    |
| Omgrofl                  |
| HLSL                     |
| DTrace                   |
| XC                       |
| Inform 7                 |
| Xojo                     |
| RMarkdown                |
| Modula-2                 |
| Ecl                      |
| Oz                       |
| UrWeb                    |
| J                        |
| ShaderLab                |
| GAMS                     |
| Self                     |
| sed                      |
| Logtalk                  |
| LOLCODE                  |
| ATS                      |
| Cool                     |
| AngelScript              |
| XPages                   |
| Uno                      |
| MQL5                     |
| Csound Score             |
| Charity                  |
| Pep8                     |
| Papyrus                  |
| Ox                       |
| Zimpl                    |
| RPC                      |
| Solidity                 |
| Cap'n Proto              |
| MQL4                     |
| Csound                   |
| TLA                      |
| CWeb                     |
| Click                    |
| MATLAB                   |
| WebIDL                   |
| Metal                    |
| Module Management System |
| mupad                    |
| P4                       |
| Ioke                     |
| YARA                     |
| KiCad Layout             |
| Ring                     |
| Nit                      |
| Max/MSP                  |
| Tea                      |
| q                        |
| Jolie                    |
| EQ                       |
| Opal                     |
| Markdown                 |
| Filebench WML            |
| Befunge                  |
| wdl                      |
| JFlex                    |
| Sass                     |
| reStructuredText         |
| Ballerina                |
| AsciiDoc                 |
| Genie                    |
| Modula-3                 |
| Moocode                  |
| Pawn                     |
| DataWeave                |
| Nearley                  |
| ShellSession             |
| LFE                      |
| YAML                     |
| Public Key               |
| Gradle                   |
| YASnippet                |
| F*                       |
| Slice                    |

There are 34 million repositories in this dataset

#+begin_src sqlite
SELECT count(*) FROM repositories
#+end_src

#+RESULTS:
| count(*) |
| 34061516 |

3.7 million javascript projects

#+begin_src sqlite
SELECT count(*) FROM repositories WHERE Language = "JavaScript"
#+end_src

#+RESULTS:
| count(*) |
|  3743183 |


1.8 million are python projects

#+begin_src sqlite
SELECT count(*) FROM repositories WHERE Language = "Python"
#+end_src

#+RESULTS:
| count(*) |
|  1824397 |

172k python packages from Pypi are included. Which is pretty close to
the [[https://pypi.org/][current count of 181k]]. Upon further inspection of their "project
dependencies" it looks like they are doing a quite naive approach to
determining the dependencies of the project. See here for an approach
[[https://github.com/nix-community/nixpkgs-pytools/blob/master/nixpkgs_pytools/python_package_init.py][that uses mocking]] of setuptools/distutils to determinate dependencies.

#+begin_src sqlite
select count(*) from projects where Platform = "Pypi"
#+end_src

#+RESULTS:
| count(*) |
|   172411 |

