notes/dependant-packages.html

<div id="outline-container-orgdd8db79" class="outline-3">
<h3 id="orgdd8db79"><span class="section-number-3">1.2</span> Discovery</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sqlite">PRAGMA table_info(repository_dependencies);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #b5bd68;">SELECT</span> <span style="color: #b5bd68;">DISTINCT</span> <span style="color: #b5bd68;">Language</span> <span style="color: #b5bd68;">FROM</span> repositories
</pre>
</div>

<p>
There are 34 million repositories in this dataset
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #b5bd68;">SELECT</span> <span style="color: #b294bb;">count</span>(*) <span style="color: #b5bd68;">FROM</span> repositories
</pre>
</div>

<p>
3.7 million javascript projects
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #b5bd68;">SELECT</span> <span style="color: #b294bb;">count</span>(*) <span style="color: #b5bd68;">FROM</span> repositories <span style="color: #b5bd68;">WHERE</span> <span style="color: #b5bd68;">Language</span> = "JavaScript"
</pre>
</div>


<p>
1.8 million are python projects
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #b5bd68;">SELECT</span> <span style="color: #b294bb;">count</span>(*) <span style="color: #b5bd68;">FROM</span> repositories <span style="color: #b5bd68;">WHERE</span> <span style="color: #b5bd68;">Language</span> = "Python"
</pre>
</div>

<p>
172k python packages from Pypi are included. Which is pretty close to
the <a href="https://pypi.org/">current count of 181k</a>. Upon further inspection of their "project
dependencies" it looks like they are doing a quite naive approach to
determining the dependencies of the project. See here for an approach
<a href="https://github.com/nix-community/nixpkgs-pytools/blob/master/nixpkgs_pytools/python_package_init.py">that uses mocking</a> of setuptools/distutils to determinate dependencies.
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #b5bd68;">select</span> <span style="color: #b294bb;">count</span>(*) <span style="color: #b5bd68;">from</span> projects <span style="color: #b5bd68;">where</span> Platform = "Pypi"
</pre>
</div>
</div>
</div>
