notes/dependant-packages.org
** Recreate libraries.io data/api
   :PROPERTIES:
   :header-args: :db ~/data/librariesio/libraries.db :header t
   :END:

The whole point of this work was to avoid having to use [[https://libraries.io/api][the rate
limited api]] (100 repositories / minute). For the work with
[[https://github.com/Quansight-Labs/python-api-inspect][python-api-inspect]] we need to gather all the packages that depend on a
given project.

Lets find certain projects ~scipy~ and ~numpy~.

#+begin_src sqlite
select * from projects where (Name = "numpy" OR Name = "scipy") and Platform = "Pypi"
#+end_src

#+RESULTS:
|    ID | Platform | Name  | Created Timestamp       | Updated Timestamp       | Description                                                         | Keywords | Homepage URL          | Licenses     | Repository URL                 | Versions Count | SourceRank | Latest Release Publish Timestamp | Latest Release Number | Package Manager ID | Dependent Projects Count | Language | Status | Last synced Timestamp   | Dependent Repositories Count | Repository ID |
| 61796 | Pypi     | numpy | 2015-01-21 00:41:56 UTC | 2018-12-20 15:41:31 UTC | NumPy: array processing for numbers, strings, records, and objects. |          | http://www.numpy.org  | BSD-3-Clause | https://github.com/numpy/numpy |             61 |         26 | 2018-12-20 15:13:12 UTC          | 1.16.0rc1             |                    |                      623 | C        |        | 2018-12-20 15:41:31 UTC |                        60568 |        726020 |
| 76799 | Pypi     | scipy | 2015-01-21 00:49:29 UTC | 2018-12-18 04:03:25 UTC | SciPy: Scientific Library for Python                                |          | https://www.scipy.org | BSD-3-Clause | https://github.com/scipy/scipy |             37 |         23 | 2018-12-18 03:06:38 UTC          | 1.2.0                 |                    |                      190 | Python   |        | 2018-12-18 04:03:25 UTC |                        31581 |        733101 |

All this work and we can now reproduce "Dependent packages"! See the
[[https://libraries.io/pypi/astropy][astropy page]]. Without indexes this query takes about 2-3 minute (now
instant). We get the same 13 packages.

#+NAME: demo-python
#+begin_src sqlite :var project="numpy" :exports both
  SELECT p.Name, r."Host Type", r."Name with Owner", r."Stars Count"
  FROM dependencies as d
  INNER JOIN projects as dp ON d."Dependency Project ID" = dp.ID
  INNER JOIN projects as p ON d."Project ID" = p.ID
  INNER JOIN repositories as r ON r.ID = p."Repository ID"
  WHERE dp.Name = "$project" AND dp.Platform = "Pypi" AND d."Dependency Name" = "$project"
  GROUP BY r."Host Type", r."Name with Owner"
  ORDER BY CAST(r."Stars Count" AS INTEGER) DESC
  LIMIT 10
#+end_src

#+RESULTS:
| Name             | Host Type | Name with Owner           | Stars Count |
| Keras            | GitHub    | keras-team/keras          |       36270 |
| face_recognition | GitHub    | ageitgey/face_recognition |       19101 |
| pandas           | GitHub    | pandas-dev/pandas         |       17217 |
| mxnet            | GitHub    | apache/incubator-mxnet    |       15870 |
| spacy            | GitHub    | explosion/spaCy           |       11565 |
| universe         | GitHub    | openai/universe           |        6905 |
| tensor2tensor    | GitHub    | tensorflow/tensor2tensor  |        6193 |
| textblob         | GitHub    | sloria/TextBlob           |        5817 |
| scipy            | GitHub    | scipy/scipy               |        5197 |
| pyxel            | GitHub    | kitao/pyxel               |        4533 |

Now we want to find "Dependant Repositories". This is a much larger
list of repositories and a better indicator or dependencies. There are
two import ant ~Manifest Platform~ (PyPi, pypi). ~Dependency Project
ID~ is what we are looking for. Having and index on this column will
greatly speedup the query.

#+begin_src sqlite :var project="numpy" :exports both
SELECT DISTINCT r."Host Type", r."Name with Owner", r."Stars Count"
FROM repository_dependencies as rd
INNER JOIN projects as p ON p.ID = rd."Dependency Project ID"
INNER JOIN repositories as r ON rd."Repository ID" = r.ID
WHERE p.Name = "$project" AND p.Platform = "Pypi" AND rd."Dependency Project Name" = "$project"
GROUP BY r."Host Type", r."Name with Owner"
ORDER BY CAST(r."Stars Count" AS INTEGER) DESC
LIMIT 10
#+end_src

#+RESULTS:
| Host Type | Name with Owner                            | Stars Count |
| GitHub    | django/django                              |       38174 |
| GitHub    | keras-team/keras                           |       36270 |
| GitHub    | scikit-learn/scikit-learn                  |       32383 |
| GitHub    | apache/incubator-superset                  |       22164 |
| GitHub    | aosabook/500lines                          |       20101 |
| GitHub    | home-assistant/home-assistant              |       19140 |
| GitHub    | ageitgey/face_recognition                  |       19101 |
| GitHub    | apache/incubator-mxnet                     |       15870 |
| GitHub    | openai/gym                                 |       14638 |
| GitHub    | donnemartin/data-science-ipython-notebooks |       14394 |

1.963K matches very closely with the [[https://libraries.io/pypi/astropy][libraries.io result]] for astropy
(1.94k) and matches numpy result 74k with 68.7k reported by
[[https://libraries.io/pypi/numpy][libraries.io]].
