notes/dependant-packages.html

<div id="outline-container-orgf2f25b6" class="outline-3">
<h3 id="orgf2f25b6"><span class="section-number-3">1.3</span> Recreate libraries.io data/api</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The whole point of this work was to avoid having to use <a href="https://libraries.io/api">the rate
limited api</a> (100 repositories / minute). For the work with
<a href="https://github.com/Quansight-Labs/python-api-inspect">python-api-inspect</a> we need to gather all the packages that depend on a
given project.
</p>

<p>
Lets find certain projects <code>scipy</code> and <code>numpy</code>.
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #b5bd68;">select</span> * <span style="color: #b5bd68;">from</span> projects <span style="color: #b5bd68;">where</span> (<span style="color: #b5bd68;">Name</span> = "numpy" <span style="color: #b5bd68;">OR</span> <span style="color: #b5bd68;">Name</span> = "scipy") <span style="color: #b5bd68;">and</span> Platform = "Pypi"
</pre>
</div>

<p>
All this work and we can now reproduce "Dependent packages"! See the
<a href="https://libraries.io/pypi/astropy">astropy page</a>. Without indexes this query takes about 2-3 minute (now
instant). We get the same 13 packages.
</p>

<div class="org-src-container">
<pre class="src src-sqlite" id="org4571a57"><span style="color: #b5bd68;">SELECT</span> p.<span style="color: #b5bd68;">Name</span>, r."<span style="color: #b5bd68;">Host</span> <span style="color: #b5bd68;">Type</span>", r."<span style="color: #b5bd68;">Name</span> <span style="color: #b5bd68;">with</span> Owner", r."Stars <span style="color: #b294bb;">Count</span>"
<span style="color: #b5bd68;">FROM</span> dependencies <span style="color: #b5bd68;">as</span> d
<span style="color: #b5bd68;">INNER</span> <span style="color: #b5bd68;">JOIN</span> projects <span style="color: #b5bd68;">as</span> dp <span style="color: #b5bd68;">ON</span> d."Dependency Project ID" = dp.ID
<span style="color: #b5bd68;">INNER</span> <span style="color: #b5bd68;">JOIN</span> projects <span style="color: #b5bd68;">as</span> p <span style="color: #b5bd68;">ON</span> d."Project ID" = p.ID
<span style="color: #b5bd68;">INNER</span> <span style="color: #b5bd68;">JOIN</span> repositories <span style="color: #b5bd68;">as</span> r <span style="color: #b5bd68;">ON</span> r.ID = p."Repository ID"
<span style="color: #b5bd68;">WHERE</span> dp.<span style="color: #b5bd68;">Name</span> = "$project" <span style="color: #b5bd68;">AND</span> dp.Platform = "Pypi" <span style="color: #b5bd68;">AND</span> d."Dependency <span style="color: #b5bd68;">Name</span>" = "$project"
<span style="color: #b5bd68;">GROUP</span> <span style="color: #b5bd68;">BY</span> r."<span style="color: #b5bd68;">Host</span> <span style="color: #b5bd68;">Type</span>", r."<span style="color: #b5bd68;">Name</span> <span style="color: #b5bd68;">with</span> Owner"
<span style="color: #b5bd68;">ORDER</span> <span style="color: #b5bd68;">BY</span> <span style="color: #b294bb;">CAST</span>(r."Stars <span style="color: #b294bb;">Count</span>" <span style="color: #b5bd68;">AS</span> <span style="color: #81a2be;">INTEGER</span>) <span style="color: #b5bd68;">DESC</span>
<span style="color: #b5bd68;">LIMIT</span> 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Name</td>
<td class="org-left">Host Type</td>
<td class="org-left">Name with Owner</td>
<td class="org-right">Stars Count</td>
</tr>

<tr>
<td class="org-left">Keras</td>
<td class="org-left">GitHub</td>
<td class="org-left">keras-team/keras</td>
<td class="org-right">36270</td>
</tr>

<tr>
<td class="org-left">face<sub>recognition</sub></td>
<td class="org-left">GitHub</td>
<td class="org-left">ageitgey/face<sub>recognition</sub></td>
<td class="org-right">19101</td>
</tr>

<tr>
<td class="org-left">pandas</td>
<td class="org-left">GitHub</td>
<td class="org-left">pandas-dev/pandas</td>
<td class="org-right">17217</td>
</tr>

<tr>
<td class="org-left">mxnet</td>
<td class="org-left">GitHub</td>
<td class="org-left">apache/incubator-mxnet</td>
<td class="org-right">15870</td>
</tr>

<tr>
<td class="org-left">spacy</td>
<td class="org-left">GitHub</td>
<td class="org-left">explosion/spaCy</td>
<td class="org-right">11565</td>
</tr>

<tr>
<td class="org-left">universe</td>
<td class="org-left">GitHub</td>
<td class="org-left">openai/universe</td>
<td class="org-right">6905</td>
</tr>

<tr>
<td class="org-left">tensor2tensor</td>
<td class="org-left">GitHub</td>
<td class="org-left">tensorflow/tensor2tensor</td>
<td class="org-right">6193</td>
</tr>

<tr>
<td class="org-left">textblob</td>
<td class="org-left">GitHub</td>
<td class="org-left">sloria/TextBlob</td>
<td class="org-right">5817</td>
</tr>

<tr>
<td class="org-left">scipy</td>
<td class="org-left">GitHub</td>
<td class="org-left">scipy/scipy</td>
<td class="org-right">5197</td>
</tr>

<tr>
<td class="org-left">pyxel</td>
<td class="org-left">GitHub</td>
<td class="org-left">kitao/pyxel</td>
<td class="org-right">4533</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Name</td>
<td class="org-left">Host Type</td>
<td class="org-left">Name with Owner</td>
<td class="org-right">Stars Count</td>
</tr>

<tr>
<td class="org-left">Keras</td>
<td class="org-left">GitHub</td>
<td class="org-left">keras-team/keras</td>
<td class="org-right">36270</td>
</tr>

<tr>
<td class="org-left">face<sub>recognition</sub></td>
<td class="org-left">GitHub</td>
<td class="org-left">ageitgey/face<sub>recognition</sub></td>
<td class="org-right">19101</td>
</tr>

<tr>
<td class="org-left">pandas</td>
<td class="org-left">GitHub</td>
<td class="org-left">pandas-dev/pandas</td>
<td class="org-right">17217</td>
</tr>

<tr>
<td class="org-left">mxnet</td>
<td class="org-left">GitHub</td>
<td class="org-left">apache/incubator-mxnet</td>
<td class="org-right">15870</td>
</tr>

<tr>
<td class="org-left">spacy</td>
<td class="org-left">GitHub</td>
<td class="org-left">explosion/spaCy</td>
<td class="org-right">11565</td>
</tr>

<tr>
<td class="org-left">universe</td>
<td class="org-left">GitHub</td>
<td class="org-left">openai/universe</td>
<td class="org-right">6905</td>
</tr>

<tr>
<td class="org-left">tensor2tensor</td>
<td class="org-left">GitHub</td>
<td class="org-left">tensorflow/tensor2tensor</td>
<td class="org-right">6193</td>
</tr>

<tr>
<td class="org-left">textblob</td>
<td class="org-left">GitHub</td>
<td class="org-left">sloria/TextBlob</td>
<td class="org-right">5817</td>
</tr>

<tr>
<td class="org-left">scipy</td>
<td class="org-left">GitHub</td>
<td class="org-left">scipy/scipy</td>
<td class="org-right">5197</td>
</tr>

<tr>
<td class="org-left">pyxel</td>
<td class="org-left">GitHub</td>
<td class="org-left">kitao/pyxel</td>
<td class="org-right">4533</td>
</tr>
</tbody>
</table>

<p>
Now we want to find "Dependant Repositories". This is a much larger
list of repositories and a better indicator or dependencies. There are
two import ant <code>Manifest Platform</code> (PyPi, pypi). <code>Dependency Project
ID</code> is what we are looking for. Having and index on this column will
greatly speedup the query.
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #b5bd68;">SELECT</span> <span style="color: #b5bd68;">DISTINCT</span> r."<span style="color: #b5bd68;">Host</span> <span style="color: #b5bd68;">Type</span>", r."<span style="color: #b5bd68;">Name</span> <span style="color: #b5bd68;">with</span> Owner", r."Stars <span style="color: #b294bb;">Count</span>"
<span style="color: #b5bd68;">FROM</span> repository_dependencies <span style="color: #b5bd68;">as</span> rd
<span style="color: #b5bd68;">INNER</span> <span style="color: #b5bd68;">JOIN</span> projects <span style="color: #b5bd68;">as</span> p <span style="color: #b5bd68;">ON</span> p.ID = rd."Dependency Project ID"
<span style="color: #b5bd68;">INNER</span> <span style="color: #b5bd68;">JOIN</span> repositories <span style="color: #b5bd68;">as</span> r <span style="color: #b5bd68;">ON</span> rd."Repository ID" = r.ID
<span style="color: #b5bd68;">WHERE</span> p.<span style="color: #b5bd68;">Name</span> = "$project" <span style="color: #b5bd68;">AND</span> p.Platform = "Pypi" <span style="color: #b5bd68;">AND</span> rd."Dependency Project <span style="color: #b5bd68;">Name</span>" = "$project"
<span style="color: #b5bd68;">GROUP</span> <span style="color: #b5bd68;">BY</span> r."<span style="color: #b5bd68;">Host</span> <span style="color: #b5bd68;">Type</span>", r."<span style="color: #b5bd68;">Name</span> <span style="color: #b5bd68;">with</span> Owner"
<span style="color: #b5bd68;">ORDER</span> <span style="color: #b5bd68;">BY</span> <span style="color: #b294bb;">CAST</span>(r."Stars <span style="color: #b294bb;">Count</span>" <span style="color: #b5bd68;">AS</span> <span style="color: #81a2be;">INTEGER</span>) <span style="color: #b5bd68;">DESC</span>
<span style="color: #b5bd68;">LIMIT</span> 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Host Type</td>
<td class="org-left">Name with Owner</td>
<td class="org-right">Stars Count</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left">django/django</td>
<td class="org-right">38174</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left">keras-team/keras</td>
<td class="org-right">36270</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left">scikit-learn/scikit-learn</td>
<td class="org-right">32383</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left">apache/incubator-superset</td>
<td class="org-right">22164</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left">aosabook/500lines</td>
<td class="org-right">20101</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left">home-assistant/home-assistant</td>
<td class="org-right">19140</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left">ageitgey/face<sub>recognition</sub></td>
<td class="org-right">19101</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left">apache/incubator-mxnet</td>
<td class="org-right">15870</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left">openai/gym</td>
<td class="org-right">14638</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left">donnemartin/data-science-ipython-notebooks</td>
<td class="org-right">14394</td>
</tr>
</tbody>
</table>

<p>
1.963K matches very closely with the <a href="https://libraries.io/pypi/astropy">libraries.io result</a> for astropy
(1.94k) and matches numpy result 74k with 68.7k reported by
<a href="https://libraries.io/pypi/numpy">libraries.io</a>.
</p>
</div>
</div>
