notes/dependant-packages.org
** Generate Initial Dependants Files

Here I use python to generate the ~*-whitelist.ini~. For now this is
just part of the demo.

#+NAME: dependents-code
#+begin_src python :results none
  import sqlite3
  import pandas

  PROJECT_QUERY = '''
  SELECT p.Name, r."Host Type", r."Name with Owner", r."Stars Count"
  FROM dependencies as d
  INNER JOIN projects as dp ON d."Dependency Project ID" = dp.ID
  INNER JOIN projects as p ON d."Project ID" = p.ID
  INNER JOIN repositories as r ON r.ID = p."Repository ID"
  WHERE dp.Name = "{project}" AND dp.Platform = "Pypi" AND d."Dependency Name" = "{project}"
  GROUP BY r."Host Type", r."Name with Owner"
  ORDER BY CAST(r."Stars Count" AS INTEGER) DESC
  '''

  REPOSITORY_QUERY = '''
  SELECT DISTINCT r."Host Type", r."Name with Owner", r."Stars Count"
  FROM repository_dependencies as rd
  INNER JOIN projects as p ON p.ID = rd."Dependency Project ID"
  INNER JOIN repositories as r ON rd."Repository ID" = r.ID
  WHERE p.Name = "{project}" AND p.Platform = "Pypi" AND rd."Dependency Project Name" = "{project}"
  GROUP BY r."Host Type", r."Name with Owner"
  ORDER BY CAST(r."Stars Count" AS INTEGER) DESC
  '''

  def _write_packages(f, df):
     packages = {}
     for index, row in list(df.iterrows()):
        if row['Host Type'] == 'GitHub' and row["Name with Owner"] not in packages:
           packages[row["Name with Owner"]] = f'github/{row["Name with Owner"]}/master\n'
     return packages

  def create_whitelist(database_filename, project, filename):
     connection = sqlite3.connect(database_filename)

     packages = {}
     with open(filename, 'w') as f:
        f.write('[packages]\n')
        f.write('# owner/repo = site/owner/repo/ref\n')
        df = pandas.read_sql(PROJECT_QUERY.format(project=project), connection)
        packages.update(_write_packages(f, df))
        print(f'dependant projects for "{project}" got {len(df)} results')
        df = pandas.read_sql(REPOSITORY_QUERY.format(project=project), connection)
        packages.update(_write_packages(f, df))
        print(f'dependant repositories for "{project}" got {len(df)} results')
        for key, value in packages.items():
           f.write(f'{key}={value}')
#+end_src

#+RESULTS: dependents-code

#+begin_src python :noweb yes :results output :async
  <<dependents-code>>

  database_filename = '/home/costrouc/data/librariesio/libraries.db'

  projects = [
      'astropy',
      'dask',
      'ipython',
      'ipywidgets',
      'matplotlib',
      'numpy',
      'pandas',
      'pyarrow',
      'pymapd',
      'pymc3',
      'pytorch',
      'requests',
      'scikit-image',
      'scikit-learn',
      'scipy',
      'statsmodels',
      'sympy',
      'tensorflow'
  ]

  for project in projects:
      create_whitelist(database_filename, project, f'../data/whitelist/{project}-whitelist.ini')
#+end_src

#+RESULTS:
#+begin_example
dependant projects for "astropy" got 10 results
dependant repositories for "astropy" got 1734 results
dependant projects for "dask" got 2 results
dependant repositories for "dask" got 1014 results
dependant projects for "ipython" got 30 results
dependant repositories for "ipython" got 24467 results
dependant projects for "ipywidgets" got 2 results
dependant repositories for "ipywidgets" got 4862 results
dependant projects for "matplotlib" got 94 results
dependant repositories for "matplotlib" got 27179 results
dependant projects for "numpy" got 447 results
dependant repositories for "numpy" got 59524 results
dependant projects for "pandas" got 72 results
dependant repositories for "pandas" got 24632 results
dependant projects for "pyarrow" got 0 results
dependant repositories for "pyarrow" got 162 results
dependant projects for "pymapd" got 0 results
dependant repositories for "pymapd" got 5 results
dependant projects for "pymc3" got 0 results
dependant repositories for "pymc3" got 86 results
dependant projects for "pytorch" got 1 results
dependant repositories for "pytorch" got 50 results
dependant projects for "requests" got 1483 results
dependant repositories for "requests" got 115558 results
dependant projects for "scikit-image" got 6 results
dependant repositories for "scikit-image" got 4890 results
dependant projects for "scikit-learn" got 29 results
dependant repositories for "scikit-learn" got 12429 results
dependant projects for "scipy" got 135 results
dependant repositories for "scipy" got 31106 results
dependant projects for "statsmodels" got 2 results
dependant repositories for "statsmodels" got 2093 results
dependant projects for "sympy" got 15 results
dependant repositories for "sympy" got 2203 results
dependant projects for "tensorflow" got 8 results
dependant repositories for "tensorflow" got 6616 results
#+end_example

Check that configparser works with the input

#+begin_src python :results output
import configparser

config = configparser.ConfigParser()
config.read('../data/whitelist/tensorflow-whitelist.ini')

for key in list(config['packages'])[:10]:
    print(key)
#+end_src

#+RESULTS:
#+begin_example
keras-team/keras
blei-lab/edward
google/prettytensor
unixpickle/anyrl-py
canaydogan/nudity
tdb-alcorn/q2
elliotwaite/laminarflow
thuml/easydl
ageron/handson-ml
google-research/bert
#+end_example
