notes/dependant-packages.html
<div id="outline-container-orga39da4c" class="outline-3">
<h3 id="orga39da4c"><span class="section-number-3">1.4</span> Generate Initial Dependants Files</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Here I use python to generate the <code>*-whitelist.ini</code>. For now this is
just part of the demo.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org79f337c"><span style="color: #b5bd68;">import</span> sqlite3
<span style="color: #b5bd68;">import</span> pandas

<span style="color: #f0c674;">PROJECT_QUERY</span> = <span style="color: #8abeb7;">'''</span>
<span style="color: #8abeb7;">SELECT p.Name, r."Host Type", r."Name with Owner", r."Stars Count"</span>
<span style="color: #8abeb7;">FROM dependencies as d</span>
<span style="color: #8abeb7;">INNER JOIN projects as dp ON d."Dependency Project ID" = dp.ID</span>
<span style="color: #8abeb7;">INNER JOIN projects as p ON d."Project ID" = p.ID</span>
<span style="color: #8abeb7;">INNER JOIN repositories as r ON r.ID = p."Repository ID"</span>
<span style="color: #8abeb7;">WHERE dp.Name = "{project}" AND dp.Platform = "Pypi" AND d."Dependency Name" = "{project}"</span>
<span style="color: #8abeb7;">GROUP BY r."Host Type", r."Name with Owner"</span>
<span style="color: #8abeb7;">ORDER BY CAST(r."Stars Count" AS INTEGER) DESC</span>
<span style="color: #8abeb7;">'''</span>

<span style="color: #f0c674;">REPOSITORY_QUERY</span> = <span style="color: #8abeb7;">'''</span>
<span style="color: #8abeb7;">SELECT DISTINCT r."Host Type", r."Name with Owner", r."Stars Count"</span>
<span style="color: #8abeb7;">FROM repository_dependencies as rd</span>
<span style="color: #8abeb7;">INNER JOIN projects as p ON p.ID = rd."Dependency Project ID"</span>
<span style="color: #8abeb7;">INNER JOIN repositories as r ON rd."Repository ID" = r.ID</span>
<span style="color: #8abeb7;">WHERE p.Name = "{project}" AND p.Platform = "Pypi" AND rd."Dependency Project Name" = "{project}"</span>
<span style="color: #8abeb7;">GROUP BY r."Host Type", r."Name with Owner"</span>
<span style="color: #8abeb7;">ORDER BY CAST(r."Stars Count" AS INTEGER) DESC</span>
<span style="color: #8abeb7;">'''</span>

<span style="color: #b5bd68;">def</span> <span style="color: #de935f;">_write_packages</span>(f, df):
<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #f0c674;">packages</span> = {}
<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #b5bd68;">for</span> index, row <span style="color: #b5bd68;">in</span> <span style="color: #b294bb;">list</span>(df.iterrows()):
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #b5bd68;">if</span> row[<span style="color: #8abeb7;">'Host Type'</span>] == <span style="color: #8abeb7;">'GitHub'</span> <span style="color: #b5bd68;">and</span> row[<span style="color: #8abeb7;">"Name with Owner"</span>] <span style="color: #b5bd68;">not</span> <span style="color: #b5bd68;">in</span> packages:
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span>packages[row[<span style="color: #8abeb7;">"Name with Owner"</span>]] = f<span style="color: #8abeb7;">'github/{row["Name with Owner"]}/master\n'</span>
<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #b5bd68;">return</span> packages

<span style="color: #b5bd68;">def</span> <span style="color: #de935f;">create_whitelist</span>(database_filename, project, filename):
<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #f0c674;">connection</span> = sqlite3.connect(database_filename)

<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #f0c674;">packages</span> = {}
<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #b5bd68;">with</span> <span style="color: #b294bb;">open</span>(filename, <span style="color: #8abeb7;">'w'</span>) <span style="color: #b5bd68;">as</span> f:
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> f.write(<span style="color: #8abeb7;">'[packages]\n'</span>)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> f.write(<span style="color: #8abeb7;">'# owner/repo = site/owner/repo/ref\n'</span>)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #f0c674;">df</span> = pandas.read_sql(PROJECT_QUERY.<span style="color: #b294bb;">format</span>(project=project), connection)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> packages.update(_write_packages(f, df))
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #b5bd68;">print</span>(f<span style="color: #8abeb7;">'dependant projects for "{project}" got {len(df)} results'</span>)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #f0c674;">df</span> = pandas.read_sql(REPOSITORY_QUERY.<span style="color: #b294bb;">format</span>(project=project), connection)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> packages.update(_write_packages(f, df))
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #b5bd68;">print</span>(f<span style="color: #8abeb7;">'dependant repositories for "{project}" got {len(df)} results'</span>)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #b5bd68;">for</span> key, value <span style="color: #b5bd68;">in</span> packages.items():
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span>f.write(f<span style="color: #8abeb7;">'{key}={value}'</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b5bd68;">import</span> sqlite3
<span style="color: #b5bd68;">import</span> pandas

<span style="color: #f0c674;">PROJECT_QUERY</span> = <span style="color: #8abeb7;">'''</span>
<span style="color: #8abeb7;">SELECT p.Name, r."Host Type", r."Name with Owner", r."Stars Count"</span>
<span style="color: #8abeb7;">FROM dependencies as d</span>
<span style="color: #8abeb7;">INNER JOIN projects as dp ON d."Dependency Project ID" = dp.ID</span>
<span style="color: #8abeb7;">INNER JOIN projects as p ON d."Project ID" = p.ID</span>
<span style="color: #8abeb7;">INNER JOIN repositories as r ON r.ID = p."Repository ID"</span>
<span style="color: #8abeb7;">WHERE dp.Name = "{project}" AND dp.Platform = "Pypi" AND d."Dependency Name" = "{project}"</span>
<span style="color: #8abeb7;">GROUP BY r."Host Type", r."Name with Owner"</span>
<span style="color: #8abeb7;">ORDER BY CAST(r."Stars Count" AS INTEGER) DESC</span>
<span style="color: #8abeb7;">'''</span>

<span style="color: #f0c674;">REPOSITORY_QUERY</span> = <span style="color: #8abeb7;">'''</span>
<span style="color: #8abeb7;">SELECT DISTINCT r."Host Type", r."Name with Owner", r."Stars Count"</span>
<span style="color: #8abeb7;">FROM repository_dependencies as rd</span>
<span style="color: #8abeb7;">INNER JOIN projects as p ON p.ID = rd."Dependency Project ID"</span>
<span style="color: #8abeb7;">INNER JOIN repositories as r ON rd."Repository ID" = r.ID</span>
<span style="color: #8abeb7;">WHERE p.Name = "{project}" AND p.Platform = "Pypi" AND rd."Dependency Project Name" = "{project}"</span>
<span style="color: #8abeb7;">GROUP BY r."Host Type", r."Name with Owner"</span>
<span style="color: #8abeb7;">ORDER BY CAST(r."Stars Count" AS INTEGER) DESC</span>
<span style="color: #8abeb7;">'''</span>

<span style="color: #b5bd68;">def</span> <span style="color: #de935f;">_write_packages</span>(f, df):
<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #f0c674;">packages</span> = {}
<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #b5bd68;">for</span> index, row <span style="color: #b5bd68;">in</span> <span style="color: #b294bb;">list</span>(df.iterrows()):
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #b5bd68;">if</span> row[<span style="color: #8abeb7;">'Host Type'</span>] == <span style="color: #8abeb7;">'GitHub'</span> <span style="color: #b5bd68;">and</span> row[<span style="color: #8abeb7;">"Name with Owner"</span>] <span style="color: #b5bd68;">not</span> <span style="color: #b5bd68;">in</span> packages:
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span>packages[row[<span style="color: #8abeb7;">"Name with Owner"</span>]] = f<span style="color: #8abeb7;">'github/{row["Name with Owner"]}/master\n'</span>
<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #b5bd68;">return</span> packages

<span style="color: #b5bd68;">def</span> <span style="color: #de935f;">create_whitelist</span>(database_filename, project, filename):
<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #f0c674;">connection</span> = sqlite3.connect(database_filename)

<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #f0c674;">packages</span> = {}
<span style="color: #969896; background-color: #22a224a427a7;"> </span>  <span style="color: #b5bd68;">with</span> <span style="color: #b294bb;">open</span>(filename, <span style="color: #8abeb7;">'w'</span>) <span style="color: #b5bd68;">as</span> f:
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> f.write(<span style="color: #8abeb7;">'[packages]\n'</span>)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> f.write(<span style="color: #8abeb7;">'# owner/repo = site/owner/repo/ref\n'</span>)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #f0c674;">df</span> = pandas.read_sql(PROJECT_QUERY.<span style="color: #b294bb;">format</span>(project=project), connection)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> packages.update(_write_packages(f, df))
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #b5bd68;">print</span>(f<span style="color: #8abeb7;">'dependant projects for "{project}" got {len(df)} results'</span>)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #f0c674;">df</span> = pandas.read_sql(REPOSITORY_QUERY.<span style="color: #b294bb;">format</span>(project=project), connection)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> packages.update(_write_packages(f, df))
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #b5bd68;">print</span>(f<span style="color: #8abeb7;">'dependant repositories for "{project}" got {len(df)} results'</span>)
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span> <span style="color: #b5bd68;">for</span> key, value <span style="color: #b5bd68;">in</span> packages.items():
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #969896; background-color: #22a224a427a7;"> </span>f.write(f<span style="color: #8abeb7;">'{key}={value}'</span>)

<span style="color: #f0c674;">database_filename</span> = <span style="color: #8abeb7;">'/home/costrouc/data/librariesio/libraries.db'</span>

<span style="color: #f0c674;">projects</span> = [
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'astropy'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'dask'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'ipython'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'ipywidgets'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'matplotlib'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'numpy'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'pandas'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'pyarrow'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'pymapd'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'pymc3'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'pytorch'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'requests'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'scikit-image'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'scikit-learn'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'scipy'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'statsmodels'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'sympy'</span>,
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #8abeb7;">'tensorflow'</span>
]

<span style="color: #b5bd68;">for</span> project <span style="color: #b5bd68;">in</span> projects:
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   create_whitelist(database_filename, project, f<span style="color: #8abeb7;">'../data/whitelist/{project}-whitelist.ini'</span>)
</pre>
</div>

<p>
Check that configparser works with the input
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b5bd68;">import</span> configparser

<span style="color: #f0c674;">config</span> = configparser.ConfigParser()
config.read(<span style="color: #8abeb7;">'../data/whitelist/tensorflow-whitelist.ini'</span>)

<span style="color: #b5bd68;">for</span> key <span style="color: #b5bd68;">in</span> <span style="color: #b294bb;">list</span>(config[<span style="color: #8abeb7;">'packages'</span>])[:10]:
<span style="color: #969896; background-color: #22a224a427a7;"> </span>   <span style="color: #b5bd68;">print</span>(key)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Christopher Ostrouchov</p>
<p class="date">Created: 2019-05-24 Fri 16:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
